espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/app/bluetooth/common/ncp/sl_ncp.c
/***************************************************************************//**
 * @file
 * @brief Bluetooth Network Co-Processor (NCP) Interface
 *******************************************************************************
 * # License
 * <b>Copyright 2022 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/

#include <stdint.h>
#include "em_common.h"
#include "em_core.h"
#include "sl_bluetooth.h"
#include "sl_status.h"
#include "app_assert.h"
#include "sl_simple_com.h"
#include "sl_ncp.h"
#include "sl_ncp_evt_filter.h"
#include "btl_interface.h"
#ifdef SL_COMPONENT_CATALOG_PRESENT
#include "sl_component_catalog.h"
#endif // SL_COMPONENT_CATALOG_PRESENT
#include "sl_simple_timer.h"
#if defined(SL_CATALOG_WAKE_LOCK_PRESENT)
#include "sl_wake_lock.h"
#endif // SL_CATALOG_WAKE_LOCK_PRESENT
#if defined(SL_CATALOG_NCP_SEC_PRESENT)
#include "sl_ncp_sec.h"
#endif // SL_CATALOG_NCP_SEC_PRESENT

// Command buffer
typedef struct {
  uint16_t len;
  uint8_t buf[SL_NCP_CMD_BUF_SIZE];
  bool available;
} cmd_t;

// Event buffer
typedef struct {
  uint16_t len;
  uint8_t buf[SL_NCP_EVT_BUF_SIZE];
  bool available;
} evt_t;

// Timer states
typedef enum {
  CMD_IDLE = 0,
  CMD_WAITING,
  CMD_RECEIVED
} timer_state_t;

static cmd_t cmd = { 0 };
static evt_t evt = { 0 };
static bool busy = false;
#if defined(SL_CATALOG_WAKE_LOCK_PRESENT)
// semaphore to disable sleep prematurely
static uint8_t sleep_semaphore = 0;
// upper bits are flags to store signal value and wait until first cmd is received
#define SLEEP_SIGNAL_PRESENT   0x80
#define SLEEP_WAITING_FIRST_RX 0x40
#define SLEEP_SIGNAL_MASK      SLEEP_WAITING_FIRST_RX | SLEEP_SIGNAL_PRESENT
#endif // SL_CATALOG_WAKE_LOCK_PRESENT

#define MSG_GET_LEN(x) ((uint16_t)(SL_BT_MSG_LEN((x)->header) \
                                   + SL_BT_MSG_HEADER_LEN))

static bool handle_user_command(uint32_t hdr, void *data);

// Command and event buffer helper functions
static void cmd_enqueue(uint16_t len, uint8_t *data);
static void cmd_dequeue(void);
static void evt_enqueue(uint16_t len, uint8_t *data);
static void evt_dequeue(void);

// Command and event helper functions
static inline bool cmd_is_available(void);
static inline void cmd_set_available(void);
static inline void cmd_clr_available(void);
static inline bool evt_is_available(void);
static inline void evt_set_available(void);
static inline void evt_clr_available(void);

// Timer handle and callback for command timeout.
static sl_simple_timer_t cmd_timer;
static void cmd_timer_cb(sl_simple_timer_t *timer, void *data);

#if defined(SL_CATALOG_WAKE_LOCK_PRESENT)
static inline bool sleep_signal_mask_is_set(void);
static inline void sleep_signal_mask_set(void);
static inline void sleep_signal_flag_clr(void);
static inline void sleep_signal_wait_clr(void);
#endif // SL_CATALOG_WAKE_LOCK_PRESENT

// -----------------------------------------------------------------------------
// Public functions (API implementation)

/**************************************************************************//**
 * Ncp Initialization function.
 *****************************************************************************/
void sl_ncp_init(void)
{
  // Clear all buffers
  cmd_dequeue();
  evt_dequeue();

  // Start reception
  sl_simple_com_receive();
  busy = false;
  #if defined(SL_CATALOG_WAKE_LOCK_PRESENT)
  sleep_semaphore = 0;
  #endif // SL_CATALOG_WAKE_LOCK_PRESENT
}

/**************************************************************************//**
 * Ncp process action function.
 *
 * @note Called through sl_system_process_action
 *****************************************************************************/
void sl_ncp_step(void)
{
  // -------------------------------
  // Command available and NCP not busy
  if (cmd_is_available() && !busy && !evt_is_available()) {
    sl_bt_msg_t *command = (sl_bt_msg_t *)cmd.buf;
    sl_bt_msg_t *response;

    #if defined(SL_CATALOG_NCP_SEC_PRESENT)
    uint32_t result = 0;
    // store if cmd was encrypted during reception for further processing
    bool cmd_is_encrypted = sl_ncp_sec_is_encrypted(&cmd.buf);
    result = sl_ncp_sec_command_handler((uint8_t*)&cmd.buf);
    if ((result & SL_NCP_SEC_CMD_PROCESS) == SL_NCP_SEC_CMD_PROCESS)
    #endif // SL_CATALOG_NCP_SEC_PRESENT
    {
      cmd_clr_available();
      // Check for user command
      if (!handle_user_command(command->header, command->data.payload)) {
        // Call Bluetooth API binary command handler
        sl_bt_handle_command(command->header, command->data.payload);
      }
    }
    #if defined(SL_CATALOG_NCP_SEC_PRESENT)
    if ((result & SL_NCP_SEC_EVT_PROCESS) == SL_NCP_SEC_EVT_PROCESS) {
      // Clear command buffer
      cmd_dequeue();
    } else if ((result & SL_NCP_SEC_RSP_PROCESS)
               == SL_NCP_SEC_RSP_PROCESS) {
      response = sl_ncp_sec_process_response(
        sl_bt_get_command_response(), cmd_is_encrypted);
    #else
    {
      response = sl_bt_get_command_response();
    #endif // SL_CATALOG_NCP_SEC_PRESENT
      // Clear command buffer
      cmd_dequeue();
      busy = true;
    #if defined(SL_CATALOG_WAKE_LOCK_PRESENT)
      // Wake up other controller
      sl_wake_lock_set_remote_req();
    #endif // SL_CATALOG_WAKE_LOCK_PRESENT
      // Transmit command response
      sl_simple_com_transmit((uint32_t)(MSG_GET_LEN(response)),
                             (uint8_t *)response);
    }
  }

  // -------------------------------
  // Event available and NCP not busy
  if (evt_is_available() && !busy) {
    evt_clr_available();
    busy = true;
    #if defined(SL_CATALOG_WAKE_LOCK_PRESENT)
    // Wake up other controller
    sl_wake_lock_set_remote_req();
    #endif // SL_CATALOG_WAKE_LOCK_PRESENT

    // Transmit events
    sl_simple_com_transmit((uint32_t)evt.len, evt.buf);
    // Clear event buffer
    evt_dequeue();
  }
}

/**************************************************************************//**
 * Local event processor.
 *
 * Use this function to process Bluetooth stack events locally on NCP.
 * Set the return value to true, if the event should be forwarded to the
 * NCP-host. Otherwise, the event is discarded locally.
 * Implement your own function to override this default weak implementation.
 *
 * @param[in] evt The event.
 *
 * @return true, if we shall send the event to the host. This is the default.
 *
 * @note Weak implementation.
 *****************************************************************************/
SL_WEAK bool sl_ncp_local_evt_process(sl_bt_msg_t *evt)
{
  (void)evt;
  return true;
}

#if defined(SL_CATALOG_BTMESH_PRESENT)

/**************************************************************************//**
 * Local event processor.
 *
 * Use this function to process Bluetooth Mesh stack events locally on NCP.
 * Set the return value to true, if the event should be forwarded to the
 * NCP-host. Otherwise, the event is discarded locally.
 * Implement your own function to override this default weak implementation.
 *
 * @param[in] evt The event.
 *
 * @return true, if we shall send the event to the host. This is the default.
 *
 * @note Weak implementation.
 *****************************************************************************/
SL_WEAK bool sl_ncp_local_btmesh_evt_process(sl_btmesh_msg_t *evt)
{
  (void)evt;
  return true;
}

#endif

/**************************************************************************//**
 * User command (message_to_target) handler callback.
 *
 * @note Weak implementation.
 *****************************************************************************/
SL_WEAK void sl_ncp_user_cmd_message_to_target_cb(void *data)
{
  (void)data;
}

/**************************************************************************//**
 * Send user command (message_to_target) response.
 *****************************************************************************/
void sl_ncp_user_cmd_message_to_target_rsp(sl_status_t result,
                                           uint8_t len,
                                           uint8_t *data)
{
  sl_bt_send_rsp_user_message_to_target(result, len, data);
}

/**************************************************************************//**
 * Send user event (message_to_host).
 *****************************************************************************/
void sl_ncp_user_evt_message_to_host(uint8_t len, uint8_t *data)
{
  sl_bt_send_evt_user_message_to_host(len, data);
}

/**************************************************************************//**
 * Handle a user API command in binary format.
 *
 * @param[in] hdr the command header.
 * @param[in] data the command payload in a byte array
 *
 * @retval true User command handled.
 * @retval false No user command found.
 *****************************************************************************/
static bool handle_user_command(uint32_t hdr, void *data)
{
  bool cmd_handled = true;

