espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/app/bluetooth/common/ncp/sl_ncp.c
  switch (SL_BT_MSG_ID(hdr)) {
    // -------------------------------
    case sl_bt_cmd_user_message_to_target_id:
      if (((uint8array *)data)->len > 0) {
        sl_ncp_user_cmd_message_to_target_cb(data);
      } else {
        sl_bt_send_rsp_user_message_to_target(SL_STATUS_FAIL, 0, NULL);
      }
      break;
    // -------------------------------
    case sl_bt_cmd_user_manage_event_filter_id:
      if (((uint8array *)data)->len > 0) {
        sl_ncp_evt_filter_handler((user_cmd_manage_event_filter_t *)data);
      } else {
        sl_bt_send_rsp_user_manage_event_filter(SL_STATUS_FAIL);
      }
      break;
    // -------------------------------
    case sl_bt_cmd_user_reset_to_dfu_id:
      bootloader_rebootAndInstall();
      break;
    // -------------------------------
    default:
      cmd_handled = false;
      break;
  }
  return cmd_handled;
}

// -----------------------------------------------------------------------------
// Functions used for communication between stack and Uart

/**************************************************************************//**
 * Bluetooth stack event handler.
 *
 * This overrides the dummy weak implementation.
 *
 * @param[in] evt Event coming from the Bluetooth stack.
 *****************************************************************************/
void sl_bt_on_event(sl_bt_msg_t *evt)
{
  if (!sl_ncp_evt_filter_is_filtered((uint32_t)SL_BT_MSG_ID(evt->header))) {
    if (sl_ncp_local_evt_process(evt)) {
      // Enqueue event
      evt_enqueue(MSG_GET_LEN(evt),
                  (uint8_t *)evt);
    }
  }
}

#if defined(SL_CATALOG_BTMESH_PRESENT)

/**************************************************************************//**
 * Bluetooth mesh stack event handler.
 *
 * This overrides the dummy weak implementation.
 *
 * @param[in] evt Event coming from the Bluetooth Mesh stack.
 *****************************************************************************/
void sl_btmesh_on_event(sl_btmesh_msg_t *evt)
{
  if (!sl_ncp_evt_filter_is_filtered((uint32_t)SL_BT_MSG_ID(evt->header))) {
    if (sl_ncp_local_btmesh_evt_process(evt)) {
      // Enqueue event
      evt_enqueue(MSG_GET_LEN(evt),
                  (uint8_t *)evt);
    }
  }
}
#endif

/**************************************************************************//**
 * Signal if ncp application can process a new received event.
 *
 * Called before putting event into event buffer.
 *
 * @param[in] len Message length
 *
 * @return True if message fits into buffer, otherwise false.
 *****************************************************************************/
static inline bool sl_ncp_can_process_event(uint32_t len)
{
  bool ret = false;
  // event fits into event buffer; otherwise don't pop it from queue
  if ((len <= (uint32_t)(sizeof(evt.buf) - evt.len)) && !evt_is_available()
      && !cmd_is_available()) {
    ret = true;
  }
  return ret;
}

/**************************************************************************//**
 * Signal if bluetooth stack can process a new received event.
 *
 * @param[in] len Message length
 *
 * @return True if message fits into buffer, otherwise false.
 *****************************************************************************/
bool sl_bt_can_process_event(uint32_t len)
{
  return sl_ncp_can_process_event(len);
}

#if defined(SL_CATALOG_BTMESH_PRESENT)
/**************************************************************************//**
 * Signal if bluetooth mesh stack can process a new received event.
 *
 * @param[in] len Message length
 *
 * @return True if message fits into buffer, otherwise false.
 *****************************************************************************/
bool sl_btmesh_can_process_event(uint32_t len)
{
  return sl_ncp_can_process_event(len);
}
#endif

/**************************************************************************//**
 * Uart transmit completed callback
 *
 * Called after Uart transmit is finished.
 *
 * @param[in] status Status of the transmission
 *****************************************************************************/
void sl_simple_com_transmit_cb(sl_status_t status)
{
  (void)status;

  #if defined(SL_CATALOG_WAKE_LOCK_PRESENT)
  // Signal other controller that it can go to sleep
  sl_wake_lock_clear_remote_req();

  // Command response completed, go to sleep if possible
  if (sleep_signal_mask_is_set()) {
    // Only decrease semaphore if a command was received before
    // i.e. not an event was sent out
    sleep_semaphore--;
    if (!sleep_semaphore) {
      // Go to sleep if signal is down and command answered
      sl_wake_lock_set_local();
    }
  }
  #endif // SL_CATALOG_WAKE_LOCK_PRESENT
  busy = false;
}

/**************************************************************************//**
 * Uart receive completed callback
 *
 * Called after Uart receive is finished.
 *
 * @param[in] status Status of the reception
 * @param[in] len Received message length
 * @param[in] data Data received
 *****************************************************************************/
void sl_simple_com_receive_cb(sl_status_t status, uint32_t len, uint8_t *data)
{
  (void)status;
  // Stop on communication error
  app_assert_status_f(status,
                      "Receive error. Received %d bytes.\n",
                      (int)len);
  // Copy command into buffer
  cmd_enqueue((uint16_t)len, data);
}

#if defined(SL_CATALOG_WAKE_LOCK_PRESENT)
/**************************************************************************//**
 * Wake-up signal arrived from host.
 * This overrides the dummy weak implementation.
 *****************************************************************************/
void sl_wake_lock_set_req_rx_cb(void)
{
  // Other end set wake-up pin, so set signaling flag. Also signal that at least
  // one command needs to be received and processed before sleep.
  sleep_signal_mask_set();
  sl_bt_send_system_awake();
}

/**************************************************************************//**
 * Go to sleep signal arrived from host.
 * This overrides the dummy weak implementation.
 *****************************************************************************/
void sl_wake_lock_clear_req_rx_cb(void)
{
  // Other end released pin, remove signaling flag
  sleep_signal_flag_clr();

  if (!sleep_semaphore) {
    // Go to sleep if signal is down and command answered
    sl_wake_lock_set_local();
  }
}
#endif // SL_CATALOG_WAKE_LOCK_PRESENT

