espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/app/bluetooth/common/ncp/sl_ncp.c
// -----------------------------------------------------------------------------
// Power manager related functions

/**************************************************************************//**
 * Check if NCP allows go to sleep
 *****************************************************************************/
bool sli_ncp_is_ok_to_sleep(void)
{
  bool result;

  result = !cmd_is_available() && !evt_is_available() && !busy;
  #if defined(SL_CATALOG_WAKE_LOCK_PRESENT)
  result = result && !sleep_semaphore;
  #endif
  return result;
}
/**************************************************************************//**
 * Routine for power manager handler
 *****************************************************************************/
sl_power_manager_on_isr_exit_t sli_ncp_sleep_on_isr_exit(void)
{
  if (sli_ncp_is_ok_to_sleep() == false) {
    return SL_POWER_MANAGER_WAKEUP;
  }
  return SL_POWER_MANAGER_IGNORE;
}

// -----------------------------------------------------------------------------
// Command and event buffer handling functions

/**************************************************************************//**
 * Put command to command buffer
 *
 * @param[in] len Command length
 * @param[in] data Command data
 *****************************************************************************/
static void cmd_enqueue(uint16_t len, uint8_t *data)
{
  sl_status_t sc;
  timer_state_t state = CMD_IDLE;

  CORE_DECLARE_IRQ_STATE;
  CORE_ENTER_ATOMIC();
  // Command fits into command buffer; otherwise discard it.
  if (len <= (sizeof(cmd.buf) - cmd.len)) {
    memcpy((void *)&cmd.buf[cmd.len], (void *)data, (size_t)len);
    cmd.len += len;
    // Part of the command received, start timer to not get stuck.
    state = CMD_WAITING;
    // Command header has been received.
    if (cmd.len >= SL_BT_MSG_HEADER_LEN) {
      // 4-byte header + len bytes payload
      uint32_t len = SL_BT_MSG_LEN(*(uint32_t *)cmd.buf) + SL_BT_MSG_HEADER_LEN;
      if (cmd.len >= len) {
        // Command has been received entirely.
        cmd_set_available();
        state = CMD_RECEIVED;
  #if defined(SL_CATALOG_WAKE_LOCK_PRESENT)
        // Command received fully, increase semaphore.
        sleep_semaphore++;
        // Also signal that a command was received, system can go to sleep after
        sleep_signal_wait_clr();
  #endif // SL_CATALOG_WAKE_LOCK_PRESENT
      }
    }
  }
  CORE_EXIT_ATOMIC();

  if (state == CMD_RECEIVED) {
    // Stop timer as the whole command was received. No problem if timer was
    // not started before, simple_timer is prepared for that.
    sc = sl_simple_timer_stop(&cmd_timer);

    app_assert_status(sc);
  } else if (state == CMD_WAITING) {
    // Start timer used for max waiting time of fragmented packets.
    sc = sl_simple_timer_start(&cmd_timer,
                               SL_NCP_CMD_TIMEOUT_MS,
                               cmd_timer_cb,
                               NULL,
                               false);
    app_assert_status(sc);
  }
}

/**************************************************************************//**
 * Clear command buffer
 *****************************************************************************/
static void cmd_dequeue(void)
{
  CORE_DECLARE_IRQ_STATE;
  CORE_ENTER_ATOMIC();
  memset((void *)cmd.buf, 0, (size_t)cmd.len);
  cmd.len = 0;
  cmd_clr_available();
  CORE_EXIT_ATOMIC();
}

/**************************************************************************//**
 * Put event to event buffer
 *
 * @param[in] len Event length
 * @param[in] data Event data
 *****************************************************************************/
static void evt_enqueue(uint16_t len, uint8_t *data)
{
  uint8_t *data_ptr;

  #if defined(SL_CATALOG_NCP_SEC_PRESENT)
  data_ptr = (uint8_t*)sl_ncp_sec_process_event((sl_bt_msg_t*)data);
  // rewrite original len as encrypted msg will be longer than original
  (void)len;
  len = MSG_GET_LEN((sl_bt_msg_t*)data_ptr);
  #else
  data_ptr = data;
  #endif // SL_CATALOG_NCP_SEC_PRESENT

  CORE_DECLARE_IRQ_STATE;
  CORE_ENTER_ATOMIC();
  // event fits into event buffer; otherwise discard it
  if (len <= (sizeof(evt.buf) - evt.len)) {
    memcpy((void *)&evt.buf[evt.len], (void *)data_ptr, len);
    evt.len += len;
    evt_set_available();
  }
  CORE_EXIT_ATOMIC();
}

/**************************************************************************//**
 * Clear event buffer
 *****************************************************************************/
static void evt_dequeue(void)
{
  CORE_DECLARE_IRQ_STATE;
  CORE_ENTER_ATOMIC();
  memset((void *)evt.buf, 0, sizeof(evt.buf));
  evt.len = 0;
  evt_clr_available();
  CORE_EXIT_ATOMIC();
}

// -----------------------------------------------------------------------------
// Timer callback function

static void cmd_timer_cb(sl_simple_timer_t *timer, void *data)
{
  (void)data;
  (void)timer;

  // Signal the other end that the command was received only partially
  // then clean buffer. The timer is already stopped.
  sl_bt_send_system_error(SL_STATUS_COMMAND_INCOMPLETE, 0, NULL);
  cmd_dequeue();
}

// -----------------------------------------------------------------------------
// Helper functions

/**************************************************************************//**
 * Get command availability in command buffer
 *****************************************************************************/
static inline bool cmd_is_available(void)
{
  return cmd.available;
}

/**************************************************************************//**
 * Set command available in command buffer
 *****************************************************************************/
static inline void cmd_set_available(void)
{
  cmd.available = true;
}

/**************************************************************************//**
 * Clear command available in command buffer
 *****************************************************************************/
static inline void cmd_clr_available(void)
{
  cmd.available = false;
}

/**************************************************************************//**
 * Get event availability in command buffer
 *****************************************************************************/
static inline bool evt_is_available(void)
{
  return evt.available;
}

/**************************************************************************//**
 * Set event available in command buffer
 *****************************************************************************/
static inline void evt_set_available(void)
{
  evt.available = true;
}

/**************************************************************************//**
 * Clear event available in command buffer
 *****************************************************************************/
static inline void evt_clr_available(void)
{
  evt.available = false;
}

#if defined(SL_CATALOG_WAKE_LOCK_PRESENT)
/**************************************************************************//**
 * Get sleep signal flag and wait for rx cmd flag state
 *****************************************************************************/
static inline bool sleep_signal_mask_is_set(void)
{
  return (sleep_semaphore & ~(SLEEP_SIGNAL_MASK));
}

/**************************************************************************//**
 * Set sleep signal flag and wait for rx cmd flag state
 *****************************************************************************/
static inline void sleep_signal_mask_set(void)
{
  sleep_semaphore |= (SLEEP_SIGNAL_PRESENT | SLEEP_WAITING_FIRST_RX);
}

/**************************************************************************//**
 * Clear sleep signal flag state
 *****************************************************************************/
static inline void sleep_signal_flag_clr(void)
{
  sleep_semaphore &= ~(SLEEP_SIGNAL_PRESENT);
}

/**************************************************************************//**
 * Clear wait for rx cmd flag state
 *****************************************************************************/
static inline void sleep_signal_wait_clr(void)
{
  sleep_semaphore &= ~(SLEEP_WAITING_FIRST_RX);
}
#endif // SL_CATALOG_WAKE_LOCK_PRESENT
